{
  "backend/main.mo": "Motoko backend defining a Tool type and providing CRUD-style functions to add, search, filter, and retrieve tools and categories.",
  "feature_evidence.json": "Feature evidence report mapping performance, SEO, and caching optimizations to affected frontend files and components.",
  "frontend-file-summaries.txt": "Plain-text list summarizing key purposes and optimizations of frontend components, hooks, styles, and HTML files.",
  "frontend/index.css": "Tailwind-based global styles defining design tokens, light/dark themes, and base styling rules.",
  "frontend/index.html": "HTML entry point including metadata, SEO tags, canonical link, and script loader for the React app.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and linking to the sitemap.",
  "frontend/public/sitemap.xml": "Sitemap containing a single URL entry for the site homepage with metadata.",
  "frontend/src/App.tsx": "Main React component orchestrating tool fetching, filtering, lazy-loaded sections, non-blocking preloading, and JSON-LD injection.",
  "frontend/src/components/CategoryFilters.tsx": "Renders clickable category badges to filter tools based on the selected category.",
  "frontend/src/components/CTASection.tsx": "CTA section with a headline and button that scrolls to the top when clicked.",
  "frontend/src/components/FAQSection.tsx": "Displays a list of FAQs using an accordion layout.",
  "frontend/src/components/Footer.tsx": "Provides footer navigation links and site attribution.",
  "frontend/src/components/Header.tsx": "Sticky header with site title and a button linking to external coupon offers.",
  "frontend/src/components/Hero.tsx": "Hero section with a headline, subheadline, and achievement badges.",
  "frontend/src/components/SearchBar.tsx": "Search input with an icon for filtering tools by name or description.",
  "frontend/src/components/SeoJsonLd.tsx": "Generates JSON-LD schema for SEO using website, organization, and tools data.",
  "frontend/src/components/ToolCard.tsx": "Displays a tool’s logo, name, rating, tags, deal, and a promotional badge in a card layout.",
  "frontend/src/components/ToolModal.tsx": "Modal showing tool details with buttons to visit the official site or partner offers.",
  "frontend/src/components/ToolsGrid.tsx": "Grid of static tool data rendered as ToolCards with modal interactions.",
  "frontend/src/components/TopBanner.tsx": "Top banner linking to external AI deals with promotional text.",
  "frontend/src/components/TrustSection.tsx": "Displays a trust section with a header and a grid of company logos loaded from static image paths.",
  "frontend/src/components/WhyUseSection.tsx": "Renders a three-column feature list, each with an icon, title, and description pulled from a local array.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, searching, and filtering tools and categories through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles, CSS variables, dark mode values, and performance optimizations like content-visibility and reduced-motion rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, container settings, animations, and plugins.",
  "frontend/TECHNICAL_VALIDATION_CHECKLIST.md": "Technical checklist documenting SEO, performance, caching, and lazy-loading optimizations while keeping the UI visually unchanged.",
  "project_state.json": "Contains project metadata, constraints, and feature requirements emphasizing pixel-identical UI and technical-only optimizations."
}